{"text": "The ChRIS Research Integration Service (ChRIS) is an open-source medical image analysis platform from Boston Children’s Hospital. It enables containerized workflows for clinical research using plugins, OpenShift, and secure data sharing. ChRIS (ChRIS Research Integration Service) is an **opensource distributed software platform** engineered to manage and coordinate computation and data across diverse computing environments. Initially developed for medical image analysis at Boston Children's Hospital, ChRIS has matured into a **general-purpose compute/data platform**. This evolution enables seamless deployment of analyses on a heterogeneous mix of resources, ranging from individual laptops to interconnected workstations, high-performance computing (HPC) clusters, and public cloud infrastructures.\n\nAt its core, ChRIS is designed to handle the execution and data requirements of a specific category of computational applications frequently employed in research settings, particularly within medical image research. These applications are characterized by their **non-interactive nature** once initiated, reliance on **command-line arguments** for runtime specifications, and the collection of all output in **files**.\n\nWhile ChRIS provides a **web-based user interface**, the actual computations are performed by **containerized, Linux-based applications**. These background processes are termed **plugins** within the ChRIS ecosystem, as they seamlessly integrate with the ChRIS backend and are accessible through various frontends.\n\nThe ChRIS architecture consists of a suite of **REST-based web services**, backend web applications, and various client-facing web frontends. The system's primary objective is to **simplify the process for developers to deploy their applications across any computing environment capable of running Linux containers**. By adhering to a standardized command-line specification for ChRIS applications, the platform facilitates effortless containerization, execution, result collection, data visualization, and collaborative sharing of research software.", "metadata": {"source": "combined", "section": "Overview", "tags": ["ChRIS", "medical imaging", "distributed computing", "OpenShift"]}}
{"text": "ChRIS (ChRIS Research Integration Service) is an open-source platform for orchestrating data and computation across diverse environments, originally developed at Boston Children’s Hospital. It facilitates containerized, non-interactive applications for medical image research.", "metadata": {"source": "chris-overview.md", "section": "Overview", "tags": ["ChRIS", "medical imaging", "distributed computing", "OpenShift"]}}
{"text": "ChRIS uses Linux containers to standardize and isolate computation. Applications called 'plugins' run inside containers and can be chained into pipelines. The system supports easy reuse of analysis software across local, HPC, or cloud environments.", "metadata": {"source": "chris-overview.md", "section": "Architecture", "tags": ["plugins", "containers", "pipelines", "HPC", "cloud"]}}
{"text": "Plugins in ChRIS are registered through the ChRIS Store and executed via the backend components: pfcon, pfioh, and pman. These services distribute jobs to OpenShift clusters for scalable execution using Kubernetes Jobs.", "metadata": {"source": "chris-overview.md", "section": "Deeper dive into how ChRIS works", "tags": ["plugin", "OpenShift", "Kubernetes", "pfcon", "pman", "pfioh"]}}
{"text": "ChRIS enables real-time collaboration and secure data sharing using Swift/Ceph. It provides strong isolation using SELinux, namespaces, and OpenShift networking, which helps maintain data privacy in clinical contexts.", "metadata": {"source": "chris-overview.md", "section": "Need", "tags": ["collaboration", "data sharing", "security", "privacy", "SELinux"]}}
{"text": "The Multi-Party Computation (MPC) plugin in ChRIS enables hospitals to compute over encrypted brain imaging data without revealing raw patient data. It leverages the Conclave Cloud Dataverse for secure MPC jobs.", "metadata": {"source": "chris-overview.md", "section": "Multi-Party Computation Example", "tags": ["MPC", "encryption", "privacy", "conclave", "dataverse"]}}
{"text": "ChRIS integrates with PACS servers and provides plugins like PACSPull and FreeSurfer to automate MRI data retrieval and brain segmentation. Outputs include 2D/3D visualizations and z-score heatmaps for analysis.", "metadata": {"source": "chris-overview.md", "section": "Example: Multi-Party Computation", "tags": ["PACS", "FreeSurfer", "MRI", "zscore", "heatmap"]}}